package Lesson_2;

//    1. Создать массив большого размера (миллион элементов).
//    2. Написать методы удаления, добавления, поиска элемента массива.
//    3. Заполнить массив случайными числами.
//    4. Написать методы, реализующие рассмотренные виды сортировок, и проверить скорость выполнения каждой.


public class Task_0 {
    public static void main(String[] args) {
        System.out.println ("Lesson_2!");
    }

}

